jws/src/test/resources/org/javelin/sws/ext/ws/axis1/case2/contractfirst/soap_11/sendXsiTypes/wrappedEncoded12plainarrays-req.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
	<soapenv:Body>
		<ns1:echo href="#id0" xmlns:ns1="http://codefirst.case2.axis1.ws.springframework.org" />
		<multiRef id="id0" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<param href="#id1" />
			<param2 href="#id2" />
		</multiRef>
		<multiRef id="id2" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns2:Param2" xmlns:ns2="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<bd href="#id3" />
			<list soapenc:arrayType="soapenc:string[3]" xsi:type="soapenc:Array">
				<list xsi:type="soapenc:string">str1</list>
				<list xsi:type="soapenc:string">str2</list>
				<list xsi:type="soapenc:string">str3</list>
			</list>
			<number href="#id4" />
			<param3Tab soapenc:arrayType="ns2:Param3[3]" xsi:type="soapenc:Array">
				<param3Tab href="#id5" />
				<param3Tab href="#id6" />
				<param3Tab href="#id7" />
			</param3Tab>
		</multiRef>
		<multiRef id="id1" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns3:Param1" xmlns:ns3="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<list soapenc:arrayType="soapenc:byte[2]" xsi:type="soapenc:Array">
				<list href="#id8" />
				<list href="#id9" />
			</list>
			<number href="#id10" />
			<param2 href="#id11" />
			<param3list soapenc:arrayType="ns3:Param3[3]" xsi:type="soapenc:Array">
				<param3list href="#id12" />
				<param3list href="#id13" />
				<param3list href="#id14" />
			</param3list>
			<string xsi:type="soapenc:string">str (String)</string>
		</multiRef>
		<multiRef id="id9" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:byte" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">-102</multiRef>
		<multiRef id="id6" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns4:Param3" xmlns:ns4="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id15" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id13" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns5:Param3" xmlns:ns5="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id15" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id8" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:byte" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">36</multiRef>
		<multiRef id="id7" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns6:Param3" xmlns:ns6="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id15" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id3" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:decimal" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">37.98</multiRef>
		<multiRef id="id11" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns7:Param2" xmlns:ns7="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<bd href="#id16" />
			<list soapenc:arrayType="soapenc:string[3]" xsi:type="soapenc:Array">
				<list xsi:type="soapenc:string">str1</list>
				<list xsi:type="soapenc:string">str2</list>
				<list xsi:type="soapenc:string">str3</list>
			</list>
			<number href="#id4" />
			<param3Tab soapenc:arrayType="ns7:Param3[3]" xsi:type="soapenc:Array">
				<param3Tab href="#id17" />
				<param3Tab href="#id18" />
				<param3Tab href="#id19" />
			</param3Tab>
		</multiRef>
		<multiRef id="id12" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns8:Param3" xmlns:ns8="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id15" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id14" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns9:Param3" xmlns:ns9="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id15" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id10" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:long" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">37</multiRef>
		<multiRef id="id5" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns10:Param3" xmlns:ns10="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id15" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id4" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:int" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">44</multiRef>
		<multiRef id="id18" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns11:Param3" xmlns:ns11="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id15" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id15" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:long" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">3</multiRef>
		<multiRef id="id19" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns12:Param3" xmlns:ns12="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id15" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id17" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="ns13:Param3" xmlns:ns13="http://codefirst.case2.axis1.ws.springframework.org" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">
			<lvalue href="#id15" />
			<svalue xsi:type="soapenc:string">value</svalue>
		</multiRef>
		<multiRef id="id16" soapenc:root="0" soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xsi:type="soapenc:decimal" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/">37.98</multiRef>
	</soapenv:Body>
</soapenv:Envelope>
